Revit 2026 API

# ProjectBrowserOptions Properties

---

The ProjectBrowserOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ShowViewPlacementOnSheetStatusIcons | Show the icons indicating view placement on sheet status. |

#### Reference

ProjectBrowserOptions Class

Autodesk.Revit.UI Namespace